import React, { useState } from 'react';

export default function AddPro({ room, setRoom, updateRoomProducts }) {

    // הגדרתי קבוע בוליאני שעל פי ערכו אמת/שקר יוצג: כפתור הוספת המוצר/מסך בחירת המוצר
    const [addButton, setAddButton] = useState(true)

    // הגדרתי קבוע מסוג מערך שיכיל את הפיזור של מערך המוצרים שיש בחדר.
    let list = [...room.products]


    // הגדרתי קבוע של מוצר מסוג אובייקט. מכיל שם שהוא מחרוזת ריקה בתור התחלה, והאם דלוק=שקר.
    const [product, setProduct] = useState({
        name: '',
        isOn: false
    })


//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// פונקציה אשר נקראת כאשר יש אירוע לחיצה על כפתור הוסף מוצר/הוסף. כאשר רצה, היא משנה את הסטייט של קבוע 
//הצגת הכפתור. אם היה שקר הופך לאמת, ולהיפך.
// כאשר נבחר חדר והמשתמש לוחץ על כפתור הוסף =מבקש לשנות את הסטייט ל-אמת. הפונקציה קוראת לפונקציה להוספת 
// מוצר חדש ורק לאחר מכן משנה את הסטייט של הצגת הכפתור ל-אמת
    const buttonChanger = () => {
        if (addButton) {
            setAddButton(false)
            return;
        }
        addPro()
        setAddButton(true)
    }

// פונקציה להוספת מוצר חדש. קריאה לפונקציה זו תקרא לפונקציה שמעדכנת את החדר כדי שיכיל את המוצרים שנבחרו.
// הפונצקיה השנייה הגיעה כ-פרופס מעמוד הצגת החדר ואלייה אנחנו שולחים את מערך המוצרים שיצרנו
    const addPro = () => {
        updateRoomProducts(list)
    }


//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

    // פונקציה אשר מקבלת אלמנט אשר מגיע מהסלקט. הפונקציה נקראת כאשר יש שינוי בבחירה
    // יצרתי משתנה מקומי שיכיל את הערך שהגיע מהסלקט ולאחר מכן עשיתי סט למוצר. שם המוצר הוא הערך של המשתנה המקומי
    const pickP = (e) => {
        let p = e.target.value;
        setProduct({
            name: p,
            isOn: false
        })
    }

//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

//פונקציה אשר נקראת כאשר המוצר שנבחר הוא מערכת סטראו. הפונקציה מריצה לולאה שעוברת על מערך המוצרים 
// אם מצאה שאחד האיברים במערך הוא גם מערכת סטראו תקפיץ שגיאה ותצא מהפונקציה מבלי להוסיף את מערכת הסטראו
// זאת בהתאם לתנאי שאסור שתהיה יותר ממערכת סטראו אחת בכל חדר
// אם לא קיימת מערכת סטראו בחדר, הפוקציה מציבה בתוך מערך המוצרים את הפיזור שלו ומיד אחריו את המוצר החדש
    const checkStereo = () => {

        for (let i = 0; i < room.products.length; i++)
            if (room.products[i].name === 'stereo system') {
                alert('error')
                return
            }
        list = [...list, product]
    }

// פונקציה אשר נקראת כאשר המוצר שנבחר הוא דוד. הפונקציה בודקת את סוג החדר, אם החדר הוא לא מקלחת/שירותים
// הפונקציה תקפיץ שגיאה ותצא מהפונקציה מבלי להוסיף את המוצר לחדר
// זאת בהתאם לתנאי שקובע שדוד יכול להיות רק בחדר מסוג מקלחת/שירותים
// אם לא קיימת מערכת סטראו בחדר, הפוקציה מציבה בתוך מערך המוצרים את הפיזור שלו ומיד אחריו את המוצר החדש
    const checkBoiler = () => {
        if (room.type !== 'bathroom/toilet') {
            alert('error')
            return
        }
        list = [...list, product]
    }

//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

//פונקציה אשר נקראת כאשר יש אירוע לחיצה על כפתור הוסף. הפונקציה המוצר שהתקבל הוא מערכת סטראו או דוד ותקרא לפונקציה
// המתאימה בהתאם. אם את שני התנאים הראשונים עברה, היא תבדוק האם המערך גדול או שווה מ-5 מוצרים, אם כן, שגיאה
// זאת בהתאם לתנאי שכל חדר יכיל עד חמישה מוצרים
// במידה ואת כל אלה עברה, היא תבדוק האם בכלל נבחר מוצר, למרות שעכשיו כשאני כותב את ההערה אני מבין שהיה
// אפשר לחסוך הרבה שעות מנוע אם את התנאי הזה הייתי שם בהתחלה, עכשיו זה כבר לא משנה. 
//אם הפונקציה מצאה שלא נבחר מוצר, תקפיץ שגיאה.
// אחרי כל תנאי וגם אם עברה את כולם, הפונקציה תקרא לפונקציה שמשנה את הצגת הכפתור. 
// בנוסף, והכי חשוב, אם הפונקציה עברה את כל התנאים, תציב בתוך מערך המוצרים את הפיזור שלו ומיד לאחר מכן את המוצר החדש.

    const checkP = () => {
        if (product.name === 'stereo system') {
            checkStereo()
            buttonChanger()
            return;
        }
        if (product.name === 'boiler') {
            checkBoiler()
            buttonChanger()
            return;
        }
        else if (room.products.length >= 5) {
            alert('error')
            buttonChanger()
            return;
        }
        else if (product.name === '') {
            alert('error')
            buttonChanger()
            return;
        }
        list = [...list, product]
        buttonChanger()
    }


//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// פונקציה שמציגה מסכים בהתאם לסטייט של מצב הצגת הכפתור.
// אם הסטייט הוא- אמת- היא תציג את כפתור הוסף מוצר
// אם הסטייט הוא-שקר- תציג את מסך הוספת המוצר שכולל בתוכו סלקט של בחירת המוצר וכפתור הוסף

    const showAddProPage = () => {
        if (addButton) {

            return (
                <div>
                    <button onClick={buttonChanger}>add product</button>
                </div>
            )
        }
        else if (!addButton) {
            return (
                <div>
                    <div>
                        <select onChange={e => pickP(e)}>
                            <option selected value='' >choose a product</option>
                            <option value='stereo system' >stereo system</option>
                            <option value='air conditioner' >air conditioner</option>
                            <option value='lamp' >lamp</option>
                            <option value='boiler' >boiler</option>
                        </select>
                    </div>

                    <div>
                        <button onClick={checkP}>add</button>
                    </div>

                </div>
            )
        }
    }

//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// חשוב מאוד! הפונקציה שמציגה את המסכים נקראת תמיד במה שהקומפוננטה מחזירה


    return (
        <div>
            {showAddProPage()}

        </div>
    )
}
