import React, { useState } from 'react'
import AddPro from './AddPro';

export default function ShowRoom({upRooms, rooms, roomIndex }) {

//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// משתנה מקומה שמכיל את המוצר באינדקס שנבחר בעמוד הבית מתוך מערך המוצרים המקורי
// לאחר מכן יצרתי סטייט של אובייקט חדר, שמכיל בתוכו את כל השדות וערכיהם של אותו משתנה מקומי שיצרתי

    let r= rooms[roomIndex]
    const [room,setRoom]=useState({
        name:r.name,
        type:r.type,
        color:r.color,
        products:r.products
    })

//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// פונקציה אשר מקבלת את מערך המוצרים מעמוד הוספת המוצרים על פי בחירת המשתמש.
// הפונקציה מעדכנת את הסטייט של החדר כאשר בשדה של המוצרים מתבצע פיזור של מערך המוצרים המעודכן
//לאחר מכן קוראת לפונקציה שמעדכנת את מערך החדרים המקורי ב-אפ. הפונקציה הגיעה כ-פרופס מ-אפ. 
// אל הפונקציה נשלח החדר המעודכן על מנת לעדכן את האיבר המתאים במערך החדרים המקורי

    const updateRoomProducts=(products)=>{
        setRoom({
            name:room.name,
            type:room.type,
            color:room.color,
            products:[...products]
        })
        upRooms(room)
    }


//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// פונקציה אשר מקבת מוצר. הפונקציה נקראת כאשר יש אירוע לחיצה על מוצר ממערך המוצרים של החדר הנבחר.
// הפונקציה בודקת האם שדה -האם דלוק? הוא שקר- אם כן היא משנה אותו לאמת וקוראת לפונקציה שמעדכנת את 
// המוצרים בחדר הנבחר.
// אם המוצר דלוק-אמת- משנה אותו ל-שקר= כלומר מכבה=כלומר הוא בצבע אדום= וקוראת לפונקציה שמעדכנת את 
// המוצרים בחדר שנבחר
    const switchStatus=(product)=>{
        debugger;
        if (!product.isOn){
            product.isOn=true;
            updateRoomProducts(room.products)
            return;
        }
        product.isOn=false;
        updateRoomProducts(room.products)
    }

    return (
        <div>
            <div>
                <h6>name: {room.name}</h6>
            </div>

            <div>
                <h6>type: {room.type}</h6>
            </div>
            <div>
                {room.products.map(product=>{
                    return(
                    <button onClick={()=>switchStatus(product)} style={{backgroundColor:product.isOn?'green':'red'}}>{product.name}</button>
                    )
                })}
            </div>
            <AddPro updateRoomProducts={updateRoomProducts} room={room} setRoom={setRoom} />
        </div>
    )
}
