import React, { useState } from "react";
import { BrowserRouter as Router, Switch, Route } from "react-router-dom";
import Home from "./components/Home";
import Title from "./components/Title";
import AddRoom from "./components/AddRoom";
import "./App.css";
import ShowRoom from "./components/ShowRoom";

function App() {
  // יצרתי מערך של חדרים. כל חדר הוא אובייקט שמכיל: שם,סוג,צבע,מערך מוצרים
  const [rooms, setRooms] = useState([
    { name: "aa", type: "bedroom", color: "blue", products: [] },
  ]);

  //יצרתי קבוע שייצג את האינדקס של חדר שנבחר. הפונקציה שמשתמשת בקבוע זה נמצאת בהמשך
  const [roomIndex, setRoomIndex] = useState();

  //------------------------------------------------------------------------------------------------------------------------
  //------------------------------------------------------------------------------------------------------------------------
  //------------------------------------------------------------------------------------------------------------------------

  //פונקציה אשם נשלחת לעמוד הוספת החדרים ומקבלת ממנו אובייקט חדר. לאחר מכן מבצעת סט למערך החדרים
  // מפזרת בתוכו את מערך החדרים הישן ומיד אחריו את החדר החדש שהתקבל.
  const addNewRoom = (room) => {
    setRooms([...rooms, room]);
  };

  //------------------------------------------------------------------------------------------------------------------------
  //------------------------------------------------------------------------------------------------------------------------
  //------------------------------------------------------------------------------------------------------------------------

  // פונקציה אשר מקבלת אובייקט חדר קיים. הפונקציה נשלחת לעמוד הבית, שם כאשר יש אירוע לחיצה על חדר מסוים
  // החדר נשלח אל הפונקציה הזו. לאחר מכן יצרתי משתנה מקומי שיכיל את האינדקס של החדר שהתקבל בתוך מערך החדרים
  // לבסוף מבצעת סט סטייט לקבוע של אינדקס החדרים ומשנה אותו לערך של המשתנה המקומי שיצרתי בפונקציה.
  const handleRoomClicked = (r) => {
    let rI = rooms.findIndex((e) => {
      if (e.name === r.name) {
        return true;
      }
    });
    setRoomIndex(rI);
  };

  //------------------------------------------------------------------------------------------------------------------------
  //------------------------------------------------------------------------------------------------------------------------
  //------------------------------------------------------------------------------------------------------------------------

  // פונקציה אשר מקבלת חדר מעמוד הוספת המוצרים. כמובן נשלחת לעמוד זה. הפונקציה עוברת בעזרת לולאה על כל
  // האיברים במערך. כאשר מוצאת איבר במערך ששדה השם שלו שווה בערכו לשדה השם של החדר שהתקבל היא משנה את
  // החדר במערך החדרים המקורי לחדר שהתקבל על ידי עמוד הוספת המוצרים.
  const upRooms = (room) => {
    for (let i = 0; i < rooms.length; i++) {
      if (rooms[i].name === room.name) {
        rooms[i] = room;
      }
    }
  };

  //------------------------------------------------------------------------------------------------------------------------
  //------------------------------------------------------------------------------------------------------------------------
  //------------------------------------------------------------------------------------------------------------------------
  return (
    <div className="App">
      <Router>
        <Title />

        <Switch>
          <Route
            exact
            path="/"
            component={() => (
              <Home handleRoomClicked={handleRoomClicked} rooms={rooms} />
            )}
          />

          <Route
            exact
            path="/addroom"
            component={() => <AddRoom addNewRoom={addNewRoom} />}
          />

          <Route
            exact
            path="/room"
            component={() => (
              <ShowRoom upRooms={upRooms} rooms={rooms} roomIndex={roomIndex} />
            )}
          />
        </Switch>
      </Router>
    </div>
  );
}

export default App;
